{"selects":[{"dataId":"ServiceIn198444","seccion":"Question 2 I want service in [language]"},{"dataId":"Sex198462","seccion":"Question 3 What is your sex?"},{"dataId":"PlaceBirthCountry198469","seccion":"Question 5 B Place of Birth Country or Territory"},{"dataId":"Citizenship198471","seccion":"Question 6 Citizenship"},{"dataId":"Country198476","seccion":"Question 7 A Your current country or territory of residence"},{"dataId":"Status198477","seccion":"Question 7 B Your immigration status in your current country of residence"},{"dataId":"Country198493","seccion":"Question 8 B Row 1 Country or Territory.  If you replied Yes to question 8 A, please give your previous country or territory of residence."},{"dataId":"Status198494","seccion":"Question 8 B Row 1 Status.  Your immigration status in your previous country of residence"},{"dataId":"Country198499","seccion":"Question 8 B Row 2 Country or Territory.  If you have more than one previous country of residence, please give your other previous country or territory of residence."},{"dataId":"Status198500","seccion":"Question 8 B Row 2 Status.  Your immigration status in your previous country of residence"},{"dataId":"MaritalStatus198520","seccion":"Question 9 A.  Your current marital status"},{"dataId":"TypeOfRelationship198543","seccion":"Question 10 C Type of Relationship.  If you replied Yes to question 10 A, please indicate if your status was married or common-law."},{"dataId":"nativeLang198560","seccion":"Languages Section Question 1 A : Native language/Mother Tongue. Please provide your native language/mother tongue."},{"dataId":"communicateLang198561","seccion":"Languages Section Question 1 B :  Are you able to communicate in English and/or French?"},{"dataId":"FreqLang198563","seccion":"Languages Section Question 1 C :  In which language are you most at ease?"},{"dataId":"CountryofIssue198566","seccion":"Question 2. The country or territory that issued your passport"},{"dataId":"CountryofIssue198587","seccion":"Question 3.  The country or territory that issued your National Identity document"},{"dataId":"Country198610","seccion":"Question 1 Current mailing address country or erritory"},{"dataId":"Prov198611","seccion":"Question 1 Current mailing address province or state only if the country is Canada or the United States"},{"dataId":"Country198623","seccion":"Question 2 Residential address country or territory"},{"dataId":"Prov198624","seccion":"Question 2 Residential address province or state only if country is Canada or the United States"},{"dataId":"Type198633","seccion":"Question 3 Type of telephone"},{"dataId":"Type198647","seccion":"Question 4 Alternate Telephone Type"},{"dataId":"PurposeOfVisit198678","seccion":"Question 2 A.  Original purpose for coming to Canada"},{"dataId":"Prov198688","seccion":"Question 1 B Province.  The Province in Canada in which the educational institution is located"},{"dataId":"CityTown198689","seccion":"Question 1 B City/Town.  The City or Town in which the educational institution is located"},{"dataId":"ExpPaidBy198701","seccion":"Question 5 B. Your expenses in Canada will be paid by"},{"dataId":"Program198705","seccion":"Question 1 A My field of study will be."},{"dataId":"Level198706","seccion":"Question 1 A My level of study will be."},{"dataId":"PermitType198710","seccion":"Question 6 B.  If you replied Yes to Question 6 A, please give the type of work permit you are applying for?"},{"dataId":"Country198727","seccion":"Question 1 Country or Territory"},{"dataId":"Prov198728","seccion":"Question 1 Province or State. Please give the Province or State if the Country is Canada or United States."},{"dataId":"Country198742","seccion":"Employment Record 1 Country or Territory"},{"dataId":"ProvState198743","seccion":"Employment Record 1 Province or State if Country is Canada or United States"},{"dataId":"Country198756","seccion":"Employment Record 2 Country or Territory"},{"dataId":"ProvState198757","seccion":"Employment Record 2 Province or State if Country is Canada or United States"},{"dataId":"Country198771","seccion":"Employment Record 3 Country or Territory"},{"dataId":"ProvState198772","seccion":"Employment Record 3 Province or State if Country is Canada or United States"}],"inputs":[{"dataId":"CRCNum198435","seccion":null},{"dataId":"Age198436","seccion":null},{"dataId":"AdultFlag198437","seccion":null},{"dataId":"FormVersion198438","seccion":null},{"dataId":"PrevAge198439","seccion":null},{"dataId":"UCIClientID198443","seccion":"Question 1 UCI"},{"dataId":"ApplicationValidatedFlag198446","seccion":null},{"dataId":"RestoreStat198448","seccion":"Restore my status as a student"},{"dataId":"Extend198449","seccion":"Apply for a study permit for the first time or extend my study permit"},{"dataId":"HiddenStat198450","seccion":null},{"dataId":"TRP198451","seccion":"Get a new temporary resident permit (for inadmissible applicants only)"},{"dataId":"AliasNameIndicator198459","seccion":"Indicate No to the Question 2 A: Have you ever used any other name such as a nickname, maiden name or alias?"},{"dataId":"AliasNameIndicator198459","seccion":"Indicate Yes to the Question 2 A: Have you ever used any other name such as a nickname, maiden name or alias?"},{"dataId":"DOBDay198464","seccion":"Question 4 Date of Birth Day in DD format"},{"dataId":"DOBMonth198465","seccion":"Question 4 Date of Birth Month in MM format"},{"dataId":"DOBYear198466","seccion":"Question 4 Date of Birth Year in YYYY format"},{"dataId":"FromDate198479","seccion":"Question 7 D The start date of your immigration status in your current country of residence in YYYY-MM-DD format"},{"dataId":"ToDate198480","seccion":"Question 7 E The end date of your immigration status in your current country of residence in YYYY-MM-DD format"},{"dataId":"FromYr198482","seccion":null},{"dataId":"FromMM198483","seccion":null},{"dataId":"FromDD198484","seccion":null},{"dataId":"ToDD198485","seccion":null},{"dataId":"ToYr198486","seccion":null},{"dataId":"ToMM198487","seccion":null},{"dataId":"PCRIndicator198489","seccion":"Indicate No to the Question 8 A:  During the past 5 years have you lived in any country or territory other than your country of citizenship or your current country or territory of residence for more than 6 months?"},{"dataId":"PCRIndicator198489","seccion":"Indicate Yes to the Question 8 A:  During the past 5 years have you lived in any country or territory other than your country of citizenship or your current country or territory of residence for more than 6 months?"},{"dataId":"FromDate198496","seccion":"Question 8 B Row 1 Status From Date.  The start date of your immigration status in your previous country of residence in YYYY-MM-DD format"},{"dataId":"ToDate198497","seccion":"Question 8 B Row 1 Status To Date. The end date of your immigration status in your previous country of residence in YYYY-MM-DD format"},{"dataId":"FromDate198502","seccion":"Question 8 B Row 2 Status From Date.    The start date of your immigration status in your previous country of residence in YYYY-MM-DD format"},{"dataId":"ToDate198503","seccion":"Question 8 B Row 2 Status To Date. The end date of your immigration status in your previous country of residence in YYYY-MM-DD format"},{"dataId":"FromYr198505","seccion":null},{"dataId":"FromMM198506","seccion":null},{"dataId":"FromDD198507","seccion":null},{"dataId":"ToYr198508","seccion":null},{"dataId":"ToMM198509","seccion":null},{"dataId":"ToDD198510","seccion":null},{"dataId":"FromYr198512","seccion":null},{"dataId":"FromMM198513","seccion":null},{"dataId":"FromDD198514","seccion":null},{"dataId":"ToYr198515","seccion":null},{"dataId":"ToMM198516","seccion":null},{"dataId":"ToDD198517","seccion":null},{"dataId":"DateOfMarriage198522","seccion":"Question 9 B. If you are married or in a common law relationship, please give the date on which you were married or entered into the common law relationship in YYYY-MM-DD format."},{"dataId":"FromYr198524","seccion":null},{"dataId":"FromMM198525","seccion":null},{"dataId":"FromDD198526","seccion":null},{"dataId":"SpouseStatus198531","seccion":"Indicate No to the Question 9 D: If you are married or in a common law relationship, is your spouse or common-law partner a Canadian citizen or permanent resident?"},{"dataId":"SpouseStatus198531","seccion":"Indicate Yes to the Question 9 D: If you are married or in a common law relationship, is your spouse or common-law partner a Canadian citizen or permanent resident?"},{"dataId":"PrevMarriedIndicator198535","seccion":"Indicate No to the Question 10 A:  Have you previously been married or in a common law relationship?"},{"dataId":"PrevMarriedIndicator198535","seccion":"Indicate Yes to the Question 10 A:  Have you previously been married or in a common law relationship?"},{"dataId":"DateCalc198537","seccion":null},{"dataId":"Year198538","seccion":null},{"dataId":"Month198539","seccion":null},{"dataId":"Day198540","seccion":null},{"dataId":"FromDate198545","seccion":"Question 10 D From Date. The start date of your previous marriage or common law relationship in YYYY-MM-DD format"},{"dataId":"ToDate198547","seccion":"Question 10 D To Date.  The end date of your previous marriage or common law relationship in YYYY-MM-DD format"},{"dataId":"FromYr198549","seccion":null},{"dataId":"FromMM198550","seccion":null},{"dataId":"FromDD198551","seccion":null},{"dataId":"ToYr198552","seccion":null},{"dataId":"ToMM198553","seccion":null},{"dataId":"ToDD198554","seccion":null},{"dataId":"DOBDay198556","seccion":"Question 4 Date of Birth Day in DD format"},{"dataId":"DOBMonth198557","seccion":"Question 4 Date of Birth Month in MM format"},{"dataId":"DOBYear198558","seccion":"Question 4 Date of Birth Year in YYYY format"},{"dataId":"LangTestIndicator198562","seccion":"Indicate Yes to the Question 3. Have you taken a test from a designated testing agency to assess your proficiency in English or French?"},{"dataId":"LangTestIndicator198562","seccion":"Indicate No to the Question 3. Have you taken a test from a designated testing agency to assess your proficiency in English or French?"},{"dataId":"IssueDate198567","seccion":"Question 3. The issue date of your passport in YYYY-MM-DD format"},{"dataId":"ExpiryDate198568","seccion":"Question 4. The expiry date of passport in YYYY-MM-DD format"},{"dataId":"YYYY198570","seccion":null},{"dataId":"MM198571","seccion":null},{"dataId":"DD198572","seccion":null},{"dataId":"YYYY198574","seccion":null},{"dataId":"MM198575","seccion":null},{"dataId":"DD198576","seccion":null},{"dataId":"TaiwanPIN198577","seccion":"Indicate NO to Question 5.  For this trip, will you use a passport issued by the Ministry of Foreign Affairs in Taiwan that includes your personal identification number?"},{"dataId":"TaiwanPIN198577","seccion":"Indicate Yes to Question 5.  For this trip, will you use a passport issued by the Ministry of Foreign Affairs in Taiwan that includes your personal identification number?"},{"dataId":"IsraelPassportIndicator198578","seccion":"Indicate NO to Question 6 :  For this trip, will you use a National Israeli passport?"},{"dataId":"IsraelPassportIndicator198578","seccion":"Indicate Yes to Question 6 :  For this trip, will you use a National Israeli passport?"},{"dataId":"natIDIndicator198582","seccion":"Indicate No to the National Identity Document Section Question 1:  Do you have a national identity document?"},{"dataId":"natIDIndicator198582","seccion":"Indicate Yes to the National Identity Document Section Question 1:  Do you have a national identity document?"},{"dataId":"IssueDate198589","seccion":"Question 4.  The issue date of your National Identity Document in YYYY-MM-DD format"},{"dataId":"ExpiryDate198590","seccion":"Question 4.  The Expiry date of your National Identity Document in YYYY-MM-DD format"},{"dataId":"usCardIndicator198594","seccion":"Indicate No to the US PR Card Section Question 1:  Do you have a US PR card?"},{"dataId":"usCardIndicator198594","seccion":"Indicate Yes to the US PR Card Section Question 1:  Do you have a US PR card?"},{"dataId":"ExpiryDate198598","seccion":"Question 4.  The Expiry date of your US PR card in YYYY-MM-DD format"},{"dataId":"SameAsMailingInd198616","seccion":"Indicate No to the Question 2:  Is your residential address the same as your mailing address?"},{"dataId":"SameAsMailingInd198616","seccion":"Indicate Yes to the Question 2:  Is your residential address the same as your mailing address?"},{"dataId":"CanadaUS198630","seccion":"Question 3 Is your telephone number in Canada format?"},{"dataId":"Other198631","seccion":"Question 3 Is your telephone number in Other format?"},{"dataId":"ActualNumber198632","seccion":null},{"dataId":"NumberExt198634","seccion":"Question 3 Telephone number extension"},{"dataId":"NumberCountry198635","seccion":"Question 3 Country code"},{"dataId":"AreaCode198637","seccion":"Question 3 3 digit Area Code"},{"dataId":"FirstThree198638","seccion":"Question 3 3 digit Exchange Number"},{"dataId":"LastFive198639","seccion":"Question 3 4 digit Subscriber Number"},{"dataId":"IntlNumber198641","seccion":"Question 3 Telephone number"},{"dataId":"CanadaUS198644","seccion":"Question 4 Is your Alternate Telephone number in Canada / U S format?"},{"dataId":"Other198645","seccion":"Question 4 Is your Alternate Telephone number in Other format?"},{"dataId":"ActualNumber198646","seccion":null},{"dataId":"NumberExt198648","seccion":"Question 4 Alternate telephone number Extension"},{"dataId":"NumberCountry198649","seccion":"Question 4 Alternate telephone number Country Code"},{"dataId":"AreaCode198651","seccion":"Question 4 3 digit Area Code"},{"dataId":"FirstThree198652","seccion":"Question 4 3 digit Exchange Number"},{"dataId":"LastFive198653","seccion":"Question 4 4 digit Subscriber Number"},{"dataId":"IntlNumber198655","seccion":"Question 4 Alternate telephone number"},{"dataId":"CanadaUS198659","seccion":"Question 5 Is your Fax number in Canada / U S format?"},{"dataId":"Other198660","seccion":"Question 5 Is your Fax number in Other format?"},{"dataId":"NumberExt198661","seccion":"Question 5 Fax number extension"},{"dataId":"NumberCountry198662","seccion":"Question 5 Fax number Country Code"},{"dataId":"ActualNumber198663","seccion":null},{"dataId":"AreaCode198665","seccion":"Question 5 3 digit Area Code"},{"dataId":"FirstThree198666","seccion":"Question 5 3 digit Exchange Number"},{"dataId":"LastFive198667","seccion":"Question 5 4 digit Subscriber Number"},{"dataId":"IntlNumber198669","seccion":"Question 5 Fax number"},{"dataId":"DateLastEntry198675","seccion":"Coming into Canada Section Question 1.  Date of your original entry to Canada in YYYY-MM-DD format"},{"dataId":"DateLastEntry198681","seccion":"Question 3.  Date of your most recent entry to Canada (if not the same as your original entry date) in YYYY-MM-DD format"},{"dataId":"docNum198684","seccion":"Question 4 Document Number.  If applicable, provide the document number of the most recent Visitor Record, Study Permit or Work Permit issued to you."},{"dataId":"FromDate198694","seccion":"Question 3 Duration of Study From Date.  The start date of your intended studies in Canada in YYYY-MM-DD format"},{"dataId":"ToDate198695","seccion":"Question 3 Duration of Study To Date.  The end date of your intended studies in Canada in YYYY-MM-DD format"},{"dataId":"Tuition198697","seccion":"Question 4. The cost of tuition for your studies"},{"dataId":"Room198698","seccion":"Question 4. The cost of Room and board for your studies"},{"dataId":"OtherCosts198699","seccion":"Question 4. The cost of Other expenses for your studies"},{"dataId":"FundsAvail198702","seccion":"Question 5 A. Funds available for your stay in Canadian dollars"},{"dataId":"WorkPermit198709","seccion":"Indicate No to the Question 6 A:  In addition to the study permit, are you also applying for a work permit?"},{"dataId":"WorkPermit198709","seccion":"Indicate Yes to the Question 6 A:  In addition to the study permit, are you also applying for a work permit?"},{"dataId":"CertNum198712","seccion":"Question 7 Certificate Number. If you have been issued a Quebec Acceptance Certificate (CAQ), please provide the Certificate Number."},{"dataId":"CertExpiry198713","seccion":"Question 7 Expiry Date.  The Expiry Date of your Quebec Acceptance Certificate (CAQ) in  YYYY-MM-DD format"},{"dataId":"EducationIndicator198715","seccion":"Indicate No to the Education Section Question 1:  Have you had any post secondary education including university, college or apprenticeship training?"},{"dataId":"EducationIndicator198715","seccion":"Indicate Yes to the Education Section Question 1:  Have you had any post secondary education including university, college or apprenticeship training?"},{"dataId":"YYYY198718","seccion":"Question 1 From Date Year. If you answered yes to the previous question, please give the year that you started your highest level of post secondary education in YYYY format."},{"dataId":"MM198719","seccion":"Question 1 From Date Month. The month that you started your highest level of post secondary education in MM format"},{"dataId":"YYYY198724","seccion":"Question 1 To Date Year.  Please give the year that you completed your highest level of post secondary education in YYYY format."},{"dataId":"MM198725","seccion":"Question 1 To Date Month. The month that you completed your highest level of post secondary education in MM format"},{"dataId":"YYYY198733","seccion":"Employment Section. Please give details of your employment for the past 10 years, including if you have held any government positions such as civil servant, judge, police officer, mayor, member of parliament, hospital administrator. Record 1 From Date Year. The year of the start of your current employment or other activity in YYYY format"},{"dataId":"MM198734","seccion":"Employment Record 1 From Date Month.  The month of the start of your current employment or other activity in MM format"},{"dataId":"YYYY198739","seccion":"Employment Record 1 To Date Year. The year that you will complete your current employment or other activity in YYYY format"},{"dataId":"MM198740","seccion":"Employment Record 1 To Date Month The month that you will complete your current employment or other activity in MM format"},{"dataId":"YYYY198747","seccion":"Employment Record 2 From Date Year. The year of the start of your previous employment or other activity in YYYY format, if applicable"},{"dataId":"MM198748","seccion":"Employment Record 2 From Date Month. The month of the start of your previous employment or other activity in MM format"},{"dataId":"YYYY198753","seccion":"Employment Record 2 To Date Year. The year that you completed your previous employment or other activity in YYYY format"},{"dataId":"MM198754","seccion":"Employment Record 2 To Date Month. The month that you completed your previous employment or other activity in MM format"},{"dataId":"YYYY198762","seccion":"Employment Record 3 From Date Year. The year of the start of your previous employment or other activity in YYYY format, if applicable"},{"dataId":"MM198763","seccion":"Employment Record 3 From Date Month. The month of the start of your previous employment or other activity in MM format"},{"dataId":"YYYY198768","seccion":"Employment Record 3 To Date Year. The year that you completed your previous employment or other activity in YYYY format"},{"dataId":"MM198769","seccion":"Employment Record 3 To Date Month. The month that you completed your previous employment or other activity in MM format"},{"dataId":"qANY198776","seccion":"Indicate No to the Background Information Section Question 1 A: Within the past two years, have you or a family member ever had tuberculosis of the lungs or been in close contact with a person with tuberculosis?"},{"dataId":"qANY198776","seccion":"Indicate Yes to the Background Information Section Question 1 A: Within the past two years, have you or a family member ever had tuberculosis of the lungs or been in close contact with a person with tuberculosis?"},{"dataId":"qBNY198777","seccion":"Indicate No to the Question 1 B: Do you have any physical or mental disorder that would require social or health services, other than medication, during a stay in Canada?"},{"dataId":"qBNY198777","seccion":"Indicate Yes to the Question 1 B: Do you have any physical or mental disorder that would require social or health services, other than medication, during a stay in Canada?"},{"dataId":"backgroundInfoCalc198779","seccion":null},{"dataId":"qANY198781","seccion":"Indicate Yes to the Question 2 A: Have you ever remained beyond the validity of your status, attended school without authorization or worked without authorization in Canada?"},{"dataId":"qANY198781","seccion":"Indicate No to the Question 2 A: Have you ever remained beyond the validity of your status, attended school without authorization or worked without authorization in Canada?"},{"dataId":"qBNY198782","seccion":"Indicate Yes to the Question 2 B: Have you ever been refused a visa or permit, denied entry or ordered to leave Canada or any other country or territory?"},{"dataId":"qBNY198782","seccion":"Indicate No to the Question 2 B: Have you ever been refused a visa or permit, denied entry or ordered to leave Canada or any other country or territory?"},{"dataId":"qCNY198783","seccion":"Indicate No to the Question 2 C: Have you previously applied to enter or remain in Canada?"},{"dataId":"qCNY198783","seccion":"Indicate Yes to the Question 2 C: Have you previously applied to enter or remain in Canada?"},{"dataId":"qANY198786","seccion":"Indicate No to the Question 3 A: Have you ever committed, been arrested for, been charged with or convicted of any criminal offence in any country or territory?"},{"dataId":"qANY198786","seccion":"Indicate Yes to the Question 3 A: Have you ever committed, been arrested for, been charged with or convicted of any criminal offence in any country or territory?"},{"dataId":"qANY198789","seccion":"Indicate No to the Question 4 A: Did you serve in any military, militia, or civil defence unit or serve in a security organization or police force (including non obligatory national service, reserve or volunteer units)?"},{"dataId":"qANY198789","seccion":"Indicate Yes to the Question 4 A: Did you serve in any military, militia, or civil defence unit or serve in a security organization or police force (including non obligatory national service, reserve or volunteer units)?"},{"dataId":"qGovtNY198794","seccion":"Indicate No to the Question 5:  Are you, or have you ever been a member or associated with any political party, or other group or organization which has engaged in or advocated violence as a means to achieving a political or religious objective, or which has been associated with criminal activity at any time?"},{"dataId":"qGovtNY198794","seccion":"Indicate Yes to the Question 5:  Are you, or have you ever been a member or associated with any political party, or other group or organization which has engaged in or advocated violence as a means to achieving a political or religious objective, or which has been associated with criminal activity at any time?"},{"dataId":"qWitnessNY198796","seccion":"Indicate No to the Question 6:  Have you ever witnessed or participated in the ill treatment of prisoners or civilians, looting or desecration of religious buildings?"},{"dataId":"qWitnessNY198796","seccion":"Indicate Yes to the Question 6:  Have you ever witnessed or participated in the ill treatment of prisoners or civilians, looting or desecration of religious buildings?"},{"dataId":"TextField2198798","seccion":"Signature of applicant or parent / legal guardian for a person under 18 years of age."},{"dataId":"C1CertificateIssueDate198799","seccion":"Signature date"},{"dataId":"FutureComm198800","seccion":"Do you consent to be contacted by CIC, or an organization at CIC’s request, in the future? (Y/N)"},{"dataId":"FutureComm198800","seccion":"Do you consent to be contacted by CIC, or an organization at CIC’s request, in the future? (Y/N)"},{"dataId":"ReaderInfo198802","seccion":null}],"textareas":[{"dataId":"FamilyName198453","seccion":"Personal Details Section Question 1 Family name as shown on your passport or travel document"},{"dataId":"GivenName198454","seccion":"Question 1 Given name or names as shown on your passport or travel document"},{"dataId":"AliasFamilyName198456","seccion":"Question 2 B If you answered yes to question 2 A, please give the family name."},{"dataId":"AliasGivenName198457","seccion":"Question 2 B If you answered yes to question 2 A, please give the given name."},{"dataId":"PlaceBirthCity198468","seccion":"Question 5 A Place of Birth City or Town"},{"dataId":"Other198478","seccion":"Question 7 C If your immigration status is other, please give details."},{"dataId":"Other198495","seccion":"Question 8 B Row 1 Other Details.  If your immigration status was other, please give details."},{"dataId":"Other198501","seccion":"Question 8 B Row 2 Other Details.   If your immigration status was other, please give details."},{"dataId":"FamilyName198528","seccion":"Question 9 C Family Name.  If you are married or in a common law relationship, please give the family name of your current spouse or common law partner."},{"dataId":"GivenName198529","seccion":"Question 9 C Given Name.  If you are married or in a common law relationship, please give the given name of your current spouse or common law partner."},{"dataId":"PMFamilyName198541","seccion":"Question 10 B Family Name .  If you replied Yes to question 10 A, please give the family name of your previous spouse or common law partner."},{"dataId":"PMGivenName198542","seccion":"Question 10 B Given Name.  If you replied Yes to question 10 A, please give the given name of your previous spouse or common law partner."},{"dataId":"PassportNum198565","seccion":"Passport Section Question 1. Your current passport number"},{"dataId":"DocNum198585","seccion":"Question 2. Your National Identity Document Number"},{"dataId":"DocNum198597","seccion":"Question 2. Your US PR Card Number"},{"dataId":"POBox198604","seccion":"Contact Information Section Question 1 Current mailing address PO box"},{"dataId":"AptUnit198605","seccion":"Question 1 Current mailing address apartment or unit number"},{"dataId":"StreetNum198606","seccion":"Question 1 Current mailing address street number"},{"dataId":"Streetname198607","seccion":"Question 1 Current mailing address street name"},{"dataId":"City198609","seccion":"Question 1 Current mailing address city or town"},{"dataId":"PostalCode198612","seccion":"Question 1 Current mailing address postal code"},{"dataId":"AptUnit198618","seccion":"Question 2  If you replied No to the previous question, please give your residential address apartment or unit number."},{"dataId":"StreetNum198619","seccion":"Question 2 Residential address street number"},{"dataId":"Streetname198620","seccion":"Question 2 Residential address street name"},{"dataId":"City198622","seccion":"Question 2 Residential address city or town"},{"dataId":"PostalCode198625","seccion":"Question 2 Residential address postal code"},{"dataId":"Email198671","seccion":"Question 6 Email address"},{"dataId":"Place198676","seccion":"Question 1.  Place of your original entry to Canada"},{"dataId":"Other198679","seccion":"Question 2 B.  If you answered Other to question 2 A, please provide details."},{"dataId":"Place198682","seccion":"Question 3.  Place of your most recent entry to Canada"},{"dataId":"SchoolName198687","seccion":"Details of intended study in Canada section Question 1 A Name of School"},{"dataId":"Address198690","seccion":"Question 1 B Address.  The street address of the educational institution"},{"dataId":"DLI198691","seccion":"Question 2 Designated Learning Institution Number"},{"dataId":"StudentNo198692","seccion":"Question 2 My student ID number is:"},{"dataId":"Other198703","seccion":"Question 5 C.  If you replied with Other to question 5 B, please provide details."},{"dataId":"FieldOfStudy198720","seccion":"Question 1 Field of Study"},{"dataId":"School198721","seccion":"Question 1 School/Facility Name"},{"dataId":"City198726","seccion":"Question 1 City/Town"},{"dataId":"Occupation198735","seccion":"Employment Record 1 Current Activity/Occupation. Your current employment or other activity"},{"dataId":"Employer198736","seccion":"Employment Record 1 Company/Employer/Facility Name. Your current employer, company or other facility"},{"dataId":"City198741","seccion":"Employment Record 1 City/Town"},{"dataId":"Occupation198749","seccion":"Employment Record 2 Previous Activity/Occupation. Your previous employment or other activity"},{"dataId":"Employer198750","seccion":"Employment Record 2 Company/Employer/Facility Name. Your previous employer, company or other facility"},{"dataId":"City198755","seccion":"Employment Record 2 City/Town"},{"dataId":"Occupation198764","seccion":"Employment Record 3 Previous Activity/Occupation. Your previous employment or other activity"},{"dataId":"Employer198765","seccion":"Employment Record 3 Company/Employer/Facility Name. Your previous employer, company or other facility"},{"dataId":"City198770","seccion":"Employment Record 3 City/Town"},{"dataId":"MedicalDetails198778","seccion":"Question 1 C. If you answered yes to question 1 A or 1 B please give details and the name of the family member, if applicable."},{"dataId":"refusedDetails198784","seccion":"Question 2 D.  If you answered yes to Question 2 A or 2 B, please give details."},{"dataId":"refusedDetails198787","seccion":"Question 3 B. If you answered yes to question 3A above, please give details."},{"dataId":"militaryServiceDetails198790","seccion":"Question 4 B. If you answered yes to question 4 A, please give dates of service and countries or territories where you served."}]}