{"selects":[{"dataId":"month1279","seccion":"My date of birth is: Month. Select value from the drop down value.","hubspotProperty":""},{"dataId":"day1280","seccion":"My date of birth is: Day. Select value from the drop down value.","hubspotProperty":""},{"dataId":"month1283","seccion":"My EOI was registered with the Ontario Immigrant Nominee Program electronically on: Month. Select value from the drop down value.","hubspotProperty":""},{"dataId":"day1284","seccion":"My EOI was registered with the Ontario Immigrant Nominee Program electronically on: Day. Select value from the drop down value.","hubspotProperty":""},{"dataId":"streamName1292","seccion":"I met all the prescribed stream criteria necessary to be approved under the: Name of Stream. Select value from the drop down menu.","hubspotProperty":""},{"dataId":"month1296","seccion":"Sign Date: Month. Select value from the drop down value.","hubspotProperty":""},{"dataId":"day1297","seccion":"Sign Date: Day. Select value from the drop down value.","hubspotProperty":""}],"inputs":[{"dataId":"lastName1275","seccion":"My full legal name is: Last Name.","hubspotProperty":""},{"dataId":"firstName1276","seccion":"My full legal name is: First Name.","hubspotProperty":""},{"dataId":"middleIntial1277","seccion":"My full legal name is: Middle Initial.","hubspotProperty":""},{"dataId":"year1281","seccion":"My date of birth is: Year","hubspotProperty":""},{"dataId":"year1285","seccion":"My EOI was registered with the Ontario Immigrant Nominee Program electronically on: Year","hubspotProperty":""},{"dataId":"option1288","seccion":"Place a checkmark in the correct box. My EOI was registered electronically by me.","hubspotProperty":""},{"dataId":"field2302","seccion":"Place a checkmark in the correct box. My EOI was registered electronically by a representative that I appointed in accordance with OINP instructions.","hubspotProperty":""},{"dataId":"field2325","seccion":"Place a checkmark in the correct box. Other","hubspotProperty":""},{"dataId":"details1287","seccion":"Place a checkmark in the correct box. Other. Please specify","hubspotProperty":""},{"dataId":"option1299","seccion":"I confirm that the information provided on this form is true, complete and accurate to the best of my knowledge.","hubspotProperty":""},{"dataId":"year1298","seccion":"Sign Date: Year","hubspotProperty":""}],"textareas":[{"dataId":"signature1295","seccion":"Signature","hubspotProperty":""}]}